## 1. Introduction and Schema Diagram


In this guided project, we're going to practice using our SQL skills to answer business questions.

![](chinook-schema.svg)

We'll continue to use the Chinook database that we've used in earlier lessons of this course. The Chinook database is provided as a SQLite database file called chinook.db. A copy of the database schema is below - you'll need to come back to this step often to consult the schema as you write your queries.

It's worth remembering that our database retains 'state', so if we run a query with a CREATE or DROP twice, the query will fail. If you have trouble, or if you manage to lock your database, we have provided a chinook-unmodified.db file that you can copy over the chinook.db to restore it back to its initial state (see this blog post on how to run shell commands within a Jupyter notebook).

Most of the queries you'll create in this guided project are more difficult than what you have written in the earlier lessons in this course, and we'll provide you with less explicit guidance on how to answer each business question. Don't be discouraged if working on these queries takes several iterations.

We have provided a solution notebook (accessible via the icon at the top of the interface). However, we recommend only consulting this as a last resort, or when you have finished and would like to see how we went about the step. Also keep in mind that there are often several 'correct' ways to write these queries, and that our solution notebook shows just one of these.

In [3]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

## 2. Overview of the Data

In [4]:
%%sql

SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table'),
 ('invoice_extend', 'view'),
 ('invoice_categry', 'view')]

In [5]:
%%sql

SELECT * FROM media_type
LIMIT 10;

SELECT * FROM employee
LIMIT 10;

 * sqlite:///chinook.db
Done.
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2016-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2016-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2017-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2017-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2017-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com'),
 (6, 'Mitchell', 'Michael', 'IT Manager', 1, '1973-07-01 00:00:00', '2016-10-17 00:00:00', '5827 Bowness Road NW', 'Calgary', 'AB', 'Canada', 'T3B 0C5', '+1 (403) 246-9887', '+1 (403) 246-9899', 'michael@chinookcorp.com'),
 (7, 'King', 'Robert', 'IT Staff', 6, '1970-05-29 00:00:00', '2017-01-02 00:00:00', '590 Columbia Boulevard West', 'Lethbridge', 'AB', 'Canada', 'T1K 5N8', '+1 (403) 456-9986', '+1 (403) 456-8485', 'robert@chinookcorp.com'),
 (8, 'Callahan', 'Laura', 'IT Staff', 6, '1968-01-09 00:00:00', '2017-03-04 00:00:00', '923 7 ST NW', 'Lethbridge', 'AB', 'Canada', 'T1H 1Y8', '+1 (403) 467-3351', '+1 (403) 467-8772', 'laura@chinookcorp.com')]

## 3. Selecting Albums to Purchase

The Chinook record store has just signed a deal with a new record label, and you've been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce:

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out which genres sell the best in the USA.

You'll need to write a query to find out which genres sell the most tracks in the USA, write up a summary of your findings, and make a recommendation for the three artists whose albums we should purchase for the store.

Write a query that returns each genre, with the number of tracks sold in the USA:
- in absolute numbers
- in percentages.

In [6]:
%%sql

SELECT 
        i.billing_country,
        t.genre_id,
        g.name genre_name,
        COUNT (g.name) tracks_sold
 
FROM invoice_line il

LEFT JOIN invoice i ON i.invoice_id = il.invoice_id
LEFT JOIN track t ON t.track_id = il.track_id
LEFT JOIN genre g ON g.genre_id = t.genre_id
WHERE i.billing_country = 'USA'

GROUP BY g.name
ORDER BY COUNT(g.name) DESC

LIMIT 10

 * sqlite:///chinook.db
Done.

[('USA', 1, 'Rock', 561),
 ('USA', 4, 'Alternative & Punk', 130),
 ('USA', 3, 'Metal', 124),
 ('USA', 14, 'R&B/Soul', 53),
 ('USA', 6, 'Blues', 36),
 ('USA', 23, 'Alternative', 35),
 ('USA', 9, 'Pop', 22),
 ('USA', 7, 'Latin', 22),
 ('USA', 17, 'Hip Hop/Rap', 20),
 ('USA', 2, 'Jazz', 14)]

Based on the sales of tracks across different genres in the USA, we should purchase the new albums by the following artists:

- Red Tone (Punk)
- Slim Jim Bites (Blues)
- Meteor and the Girls (Pop)

It's worth keeping in mind that combined, these three genres only make up only 17% of total sales, so we should be on the lookout for artists and albums from the 'rock' genre, which accounts for 53% of sales.

In [7]:
%%sql

WITH USA_sold AS

(
SELECT 
            i.invoice_id,
            il.track_id
    
FROM invoice_line il
LEFT JOIN invoice i ON i.invoice_id = il.invoice_id

WHERE i.billing_country = 'USA'
)

-- The number of lines on inovice_lince joined with invoice table filtered
--for the USA shows the total number of tracks sold in the USA
SELECT
    g.name genre_name,
    COUNT (t.genre_id) tracks_sold,
    ROUND (CAST(COUNT (t.genre_id) AS FLOAT) / (SELECT COUNT(*) FROM USA_sold),2) percentage
    
FROM USA_sold

LEFT JOIN track t ON t.track_id = USA_sold.track_id
LEFT JOIN genre g ON g.genre_id = t.genre_id
GROUP BY genre_name
ORDER BY tracks_sold DESC

LIMIT 10

Done.

[('Rock', 561, 0.53),
 ('Alternative & Punk', 130, 0.12),
 ('Metal', 124, 0.12),
 ('R&B/Soul', 53, 0.05),
 ('Blues', 36, 0.03),
 ('Alternative', 35, 0.03),
 ('Latin', 22, 0.02),
 ('Pop', 22, 0.02),
 ('Hip Hop/Rap', 20, 0.02),
 ('Jazz', 14, 0.01)]

We ran a query linking the invoive, invoice line, track and genre tables, with 3 joins between them, this way we managed to get the billing counter, and the most popular track genres. As can be seen, the top three are, Rock, Alt Punk and Metal in the USA.

In [8]:
%%sql


SELECT 
            COUNT(*)
    
FROM invoice_line il
LEFT JOIN invoice i ON i.invoice_id = il.invoice_id

WHERE i.billing_country = 'USA'

Done.

[(1051,)]

## 4.  Analyzing Employee Sales Performance

Write a query that finds the total dollar amount of sales assigned to each sales support agent within the company. Add any extra attributes for that employee that you find are relevant to the analysis.

Write a short statement describing your results, and providing a possible interpretation.

In [7]:
%%sql

WITH customer_total AS
    (
        SELECT 
            c.support_rep_id,
            ROUND (SUM(i.total),2) total_sales
        FROM customer c
        LEFT JOIN invoice i ON c.customer_id = i.customer_id
        GROUP BY 1
        ORDER BY 2 DESC
    )
    
SELECT 
    e.first_name || ' ' || e.last_name Sales_agent_name,
    e.birthdate,
    e.hire_date,

    e.country,
    ct.total_sales

FROM customer_total ct
LEFT JOIN employee e  ON ct.support_rep_id = e. employee_id

ORDER BY 5 DESC

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '1973-08-29 00:00:00', '2017-04-01 00:00:00', 'Canada', 1731.51),
 ('Margaret Park', '1947-09-19 00:00:00', '2017-05-03 00:00:00', 'Canada', 1584.0),
 ('Steve Johnson', '1965-03-03 00:00:00', '2017-10-17 00:00:00', 'Canada', 1393.92)]

## 5. Analyzing Sales by Country

Write a query that collates data on purchases from different countries.
Where a country has only one customer, collect them into an "Other" group.
The results should be sorted by the total sales from highest to lowest, with the "Other" group at the very bottom.
For each country, include:

total number of customers

total value of sales

average value of sales per customer

average order value

In [10]:
%%sql
WITH country_sales_customers AS(
    SELECT
        COUNT(DISTINCT(c.customer_id)) customer_count,
        ROUND (SUM(i.total),2) total_sales,
        c.country country_temp,
        AVG(i.total) average_order,
    
        CASE
            WHEN COUNT(DISTINCT(c.customer_id)) = 1 THEN  'Other'
            ELSE c.country
        END AS Country   
    FROM customer c

    LEFT JOIN invoice i ON i.customer_id = c.customer_id
    GROUP BY 3
    ORDER BY 1 DESC
)  

SELECT 
Country,
SUM(customer_count) total_customers,
SUM(total_sales) total_Value_sales,
ROUND(SUM(total_sales)/SUM(customer_count),2)  avg_sale_per_cust,
ROUND(average_order,2) avergae_order


FROM (
    SELECT
        csc.*,
        CASE
            WHEN csc.Country = 'Other' THEN 1
            ElSE 0
        END AS sort
    FROM country_sales_customers csc
    )

GROUP BY Country
ORDER BY sort, total_sales DESC

Done.

[('USA', 13, 1040.49, 80.04, 7.94),
 ('Canada', 8, 535.59, 66.95, 7.05),
 ('Brazil', 5, 427.68, 85.54, 7.01),
 ('France', 5, 389.07, 77.81, 7.78),
 ('Germany', 4, 334.62, 83.66, 8.16),
 ('Czech Republic', 2, 273.24, 136.62, 9.11),
 ('United Kingdom', 3, 245.52, 81.84, 8.77),
 ('Portugal', 2, 185.13, 92.56, 6.38),
 ('India', 2, 183.15, 91.58, 8.72),
 ('Other', 15, 1094.94, 73.0, 7.52)]

Observations

## 6. Albums vs Individual Tracks

In order to answer the question, we're going to have to identify whether each invoice has all the tracks from an album. We can do this by getting the list of tracks from an invoice and comparing it to the list of tracks from an album. We can find the album to compare the purchase to by looking up the album that one of the purchased tracks belongs to. It doesn't matter which track we pick, since if it's an album purchase, that album will be the same for all tracks.



Write a query that categorizes each invoice as either an album purchase or not, and calculates the following summary statistics:
Number of invoices
Percentage of invoices
Write one to two sentences explaining your findings, and making a prospective recommendation on whether the Chinook store should continue to buy full albums from record companies

In [8]:

%%sql
--DROP VIEW invoice_extend;


CREATE VIEW invoice_extend AS

    SELECT 
        i.invoice_id,
        il. track_id
    FROM invoice i

    LEFT JOIN invoice_line il on il.invoice_id = i.invoice_id

 * sqlite:///chinook.db
(sqlite3.OperationalError) table invoice_extend already exists
[SQL: --DROP VIEW invoice_extend;


CREATE VIEW invoice_extend AS

    SELECT
        i.invoice_id,
        il. track_id
    FROM invoice i

    LEFT JOIN invoice_line il on il.invoice_id = i.invoice_id]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [10]:
%%sql

CREATE VIEW invoice_categry AS


WITH invoice_first_track AS
(
     SELECT
         il.invoice_id invoice_id,
         MIN(il.track_id) first_track_id
     FROM invoice_line il
     GROUP BY 1
)

SELECT
invoice_id,

CASE
    WHEN
    (
        (
            SELECT t.track_id FROM track t
            WHERE t.album_id = (
                                SELECT t1.album_id FROM track t1
                                WHERE t1.track_id = ifs.first_track_id
                                )
            
            EXCEPT
            
            SELECT il1.track_id FROM invoice_line il1
            WHERE il1.invoice_id = ifs.invoice_id
            ) IS NULL

        AND

           (
            SELECT il1.track_id FROM invoice_line il1
            WHERE il1.invoice_id = ifs.invoice_id
            
            EXCEPT
               
            SELECT t.track_id FROM track t
            WHERE t.album_id = (
                                SELECT t1.album_id FROM track t1
                                WHERE t1.track_id = ifs.first_track_id
                                )
            

               
            ) IS NULL
    )
       
    THEN 'YES'
    
    ELSE 'NO'
    
    END
    
    AS full_album_purchase

FROM invoice_first_track ifs

ORDER BY invoice_id

 * sqlite:///chinook.db
(sqlite3.OperationalError) table invoice_categry already exists
[SQL: CREATE VIEW invoice_categry AS


WITH invoice_first_track AS
(
     SELECT
         il.invoice_id invoice_id,
         MIN(il.track_id) first_track_id
     FROM invoice_line il
     GROUP BY 1
)

SELECT
invoice_id,

CASE
    WHEN
    (
        (
            SELECT t.track_id FROM track t
            WHERE t.album_id = (
                                SELECT t1.album_id FROM track t1
                                WHERE t1.track_id = ifs.first_track_id
                                )

            EXCEPT

            SELECT il1.track_id FROM invoice_line il1
            WHERE il1.invoice_id = ifs.invoice_id
            ) IS NULL

        AND

           (
            SELECT il1.track_id FROM invoice_line il1
            WHERE il1.invoice_id = ifs.invoice_id

            EXCEPT

            SELECT t.track_id FROM track t
            WHERE t.album_id = (
                                SELECT t1.album_id FROM track t1
                                WHERE t1.track_id = ifs.first_track_id
                                )



            ) IS NULL
    )

    THEN 'YES'

    ELSE 'NO'

    END

    AS full_album_purchase

FROM invoice_first_track ifs

ORDER BY invoice_id]
(Background on this error at: http://sqlalche.me/e/e3q8)

I took some help for the CASE logic formt he supplied solution and an explanation from the discussion pages that I doiwnloaded.

In [14]:
%%sql

SELECT 

ic.full_album_purchase,
COUNT (ic.invoice_id) number_of_invoices,
CAST(COUNT(ic.invoice_id) AS FLOAT) / (SELECT COUNT (*) FROM invoice) percent


FROM invoice_categry ic

GROUP BY ic.full_album_purchase

Done.

[('NO', 500, 0.8143322475570033), ('YES', 114, 0.18566775244299674)]

In [12]:
%%sql

WITH invoice_first_track AS -- Supplied solution
    (
     SELECT
         il.invoice_id invoice_id,
         MIN(il.track_id) first_track_id
     FROM invoice_line il
     GROUP BY 1
    )

SELECT
    album_purchase,
    COUNT(invoice_id) number_of_invoices,
    CAST(count(invoice_id) AS FLOAT) / (
                                         SELECT COUNT(*) FROM invoice
                                      ) percent
FROM
    (
    SELECT
        ifs.*,
        CASE
            WHEN
                 (
                  SELECT t.track_id FROM track t
                  WHERE t.album_id = (
                                      SELECT t2.album_id FROM track t2
                                      WHERE t2.track_id = ifs.first_track_id
                                     ) 

                  EXCEPT 

                  SELECT il2.track_id FROM invoice_line il2
                  WHERE il2.invoice_id = ifs.invoice_id
                 ) IS NULL
             AND
                 (
                  SELECT il2.track_id FROM invoice_line il2
                  WHERE il2.invoice_id = ifs.invoice_id

                  EXCEPT 

                  SELECT t.track_id FROM track t
                  WHERE t.album_id = (
                                      SELECT t2.album_id FROM track t2
                                      WHERE t2.track_id = ifs.first_track_id
                                     ) 
                 ) IS NULL
             THEN "yes"
             ELSE "no"
         END AS "album_purchase"
     FROM invoice_first_track ifs
    )
GROUP BY album_purchase;

 * sqlite:///chinook.db
Done.

[('no', 500, 0.8143322475570033), ('yes', 114, 0.18566775244299674)]

Step 7 of 7 Extra practice


Which artist is used in the most playlists?

In [68]:
%%sql

SELECT

    COUNT(il.track_id) times_downloaded,
    il.track_id,
    t.name track_name,
    a.title album_title,
    ar.name artist_name


FROM invoice_line il

LEFT JOIN track t ON t.track_id = il.track_id
LEFT JOIN album a ON a.album_id = t.album_id
LEFT JOIN artist ar ON ar.artist_id = a.artist_id
    
GROUP BY 5
ORDER BY times_downloaded DESC
LIMIT 10;

Done.

[(192, 2281, 'My Melancholy Blues', 'News Of The World', 'Queen'),
 (187, 1495, 'Highway Chile', 'Are You Experienced?', 'Jimi Hendrix'),
 (130, 2014, 'Something In The Way', 'Nevermind', 'Nirvana'),
 (130, 2405, "Road Trippin'", 'Californication', 'Red Hot Chili Peppers'),
 (129, 2215, 'Indifference', 'Vs.', 'Pearl Jam'),
 (124, 22, 'Whole Lotta Rosie', 'Let There Be Rock', 'AC/DC'),
 (124, 1187, 'My World', 'Use Your Illusion II', "Guns N' Roses"),
 (121, 1032, 'New Way Home', 'The Colour And The Shape', 'Foo Fighters'),
 (117, 2704, 'Mean Disposition', 'Voodoo Lounge', 'The Rolling Stones'),
 (106, 1900, 'To Live Is To Die', '...And Justice For All', 'Metallica')]

How many tracks have been purchased vs not purchased?

In [57]:
%%sql

WITH tracks_purchased AS
(
        SELECT
            il.track_id

        FROM invoice_line il
)


SELECT 
COUNT(*) not_purchased

FROM (

    SELECT t.track_id FROM track t
    EXCEPT
    SELECT  tp.track_id FROM tracks_purchased tp
)

Done.

[(1697,)]

In [62]:
%%sql

SELECT
            COUNT(DISTINCT(il.track_id)) number_purchased_tracks

        FROM invoice_line il

Done.

[(1806,)]

In [61]:
%%sql

SELECT
            COUNT(track_id) total_tracks

        FROM track t

Done.

[(3503,)]

Adding the not_purchased and the number_of_purchased tracks will give the totla. So it checks out.

Is the range of tracks in the store reflective of their sales popularity?


We already have the highest sales tracks/albums. Lets compare that with artist popularity in playlists:

In [81]:
%%sql


SELECT

    pt.track_id,
    COUNT(DISTINCT pt.playlist_id) no_of_playlists,
    p.name playlist_name,
    t.album_id album_id_in_playlist,
    a.title album_title,
    ar.name artist_name
    
FROM playlist_track pt

LEFT JOIN track t ON t.track_id = pt.track_id
LEFT JOIN playlist p ON pt.playlist_id = p.playlist_id
LEFT JOIN album a ON a.album_id = pt.track_id
LEFT JOIN artist ar ON ar.artist_id = a.artist_id

GROUP BY artist_name
ORDER BY COUNT(pt.track_id) DESC
LIMIT 10

Done.

[(597, 14, 'On-The-Go 1', 48, None, None),
 (114, 3, 'Music', 12, 'Virtual XI', 'Iron Maiden'),
 (138, 3, 'Music', 14, 'The Song Remains The Same (Disc 2)', 'Led Zeppelin'),
 (66, 3, 'Music', 8, 'The Battle Rages On', 'Deep Purple'),
 (152, 4, 'Heavy Metal Classic', 16, 'Master Of Puppets', 'Metallica'),
 (236, 4, 'Brazilian Music', 23, 'Pop', 'U2'),
 (256, 3, 'Music', 24, 'Speak of the Devil', 'Ozzy Osbourne'),
 (182, 3, 'Music', 18, 'Vs.', 'Pearl Jam'),
 (82, 3, 'Music', 9, 'The Colour And The Shape', 'Foo Fighters'),
 (53, 3, 'Music', 7, 'Vozes do MPB', 'Various Artists')]

Do protected vs non-protected media types have an effect on popularity?


--the store HAS SOLD 1806 distinct tracks, out of the 3503 total tracks available. We do the portected/popularity analysis on the 1806 tracks SOLD.

In [98]:
%%sql 
    
WITH track_media AS 
(    
    SELECT 
        CASE
            WHEN m.name LIKE "%protected%" 
            THEN "Yes"
            ELSE "No"
        END protected,
        t.track_id
    FROM media_type m
    INNER JOIN track t ON t.media_type_id = m.media_type_id
    
)

SELECT
    tm.protected,
    COUNT(DISTINCT(il.track_id)) num_tracks_sold,
    ROUND(CAST(COUNT(DISTINCT il.track_id) AS FLOAT)/1806*100,2) perc_sold 
FROM invoice_line il
LEFT JOIN track_media tm ON il.track_id = tm.track_id
GROUP BY 1;

Done.

[('No', 1652, 91.47), ('Yes', 154, 8.53)]